#include <stdio.h>

#include "app_car_type.h"

const static T_CAR_TYPE_PROTOCOL mCarProtocol[]={
	{0, 2},		/* 0, 2012款 1.5T 手动两驱都市型 */	
	{1, 2},		/* 1, 2012款 1.5T 手动两驱精英型 */
	{2, 2},		/* 2, 2012款 1.5T 手动两驱尊贵型 */
	{3, 4},		/* 3, 2013款 1.5T 手动四驱都市型 */
	{4, 4},		/* 4, 2013款 1.5T 手动四驱精英型 */
	{5, 4},		/* 5, 2013款 1.5T 手动四驱尊贵型 */
	{6, 4},		/* 6, 2013款 1.5T 手动四驱精英型 升级版 */
	{7, 4},		/* 7, 2013款 1.5T 手动四驱尊贵型 升级版 */
	{8, 4},		/* 8, 2013款 1.5T 手动四驱精英型 运动版 */
	{9, 4},		/* 9, 2013款 1.5T 手动四驱尊贵型 运动版 */
	{10, 3},	/* 10, 2013款 1.5T 手动两驱都市型 升级版 */
	{11, 3},	/* 11, 2013款 1.5T 手动两驱精英型 升级版 */
	{12, 3},	/* 12, 2013款 1.5T 手动两驱都市型 运动版 */
	{13, 3},	/* 13, 2013款 1.5T 手动两驱精英型 运动版 */
	{14, 3},	/* 14, 2013款 1.5T 手动两驱尊贵型 运动版 */
	{15, 3},	/* 15, 2013款 1.5T 手动两驱尊贵型 升级版 */
	{16, 5},	/* 16, 2013款 2.4L 自动两驱精英型 升级版 */
	{17, 5},	/* 17, 2013款 2.4L 自动两驱尊贵型 升级版 */
	{18, 4},	/* 18, 2014款 1.5T 手动四驱都市型 运动版 */
	{19, 4},	/* 19, 2014款 1.5T 手动四驱精英型 运动版 */
	{20, 4},	/* 20, 2014款 1.5T 手动四驱精英型 升级版 */
	{21, 3},	/* 21, 2014款 1.5T 手动两驱精英型 运动版 */
	{22, 3},	/* 22, 2014款 1.5T 手动两驱精英型 升级版 */
	{23, 3},	/* 23, 2015款 1.5T 手动两驱都市型 升级版 */
	{24, 3},	/* 24, 2015款 1.5T 手动两驱精英型 升级版 */
	{25, 3},	/* 25, 2015款 1.5T 手动两驱尊贵型 升级版 */
	{26, 4},	/* 26, 2015款 1.5T 手动四驱都市型 升级版 */
	{27, 4},	/* 27, 2015款 1.5T 手动四驱精英型 升级版 */
	{28, 4},	/* 28, 2015款 1.5T 手动四驱尊贵型 升级版 */
	{29, 6},	/* 29, 2015款 1.5T 手动两驱精英型 运动版 */
	{30, 6},	/* 30, 2015款 1.5T 手动两驱尊贵型 运动版 */
	{31, 4},	/* 31, 2015款 1.5T 手动四驱精英型 运动版 */
	{32, 4},	/* 32, 2015款 1.5T 手动四驱尊贵型 运动版 */
	{33, 7},	/* 33, 2015款 1.5T 自动两驱豪华型 运动版 */
	{34, 7},	/* 34, 2015款 1.5T 自动两驱尊享型 运动版 */
};

/* 根据车型代码返回协议类型 */
U8 app_get_protocol(U8 car_type)
{
	/* sanity check */
	if (car_type >= sizeof(mCarProtocol)/sizeof(T_CAR_TYPE_PROTOCOL))
	{
		dbg_string("Fatal Error: unknown car type:%d\n", car_type);
		return 0;
	}
	return mCarProtocol[car_type].protocol;
}

